GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f26q10.inc
;----- CLC4POL Bits -----------------------------------------------------
G1POL            EQU  H'0000'
G2POL            EQU  H'0001'
G3POL            EQU  H'0002'
G4POL            EQU  H'0003'
POL_CLC4POL      EQU  H'0007'
LC4G1POL         EQU  H'0000'
LC4G2POL         EQU  H'0001'
LC4G3POL         EQU  H'0002'
LC4G4POL         EQU  H'0003'
LC4POL           EQU  H'0007'


;----- CLC4SEL0 Bits -----------------------------------------------------
D1S0             EQU  H'0000'
D1S1             EQU  H'0001'
D1S2             EQU  H'0002'
D1S3             EQU  H'0003'
D1S4             EQU  H'0004'
D1S5             EQU  H'0005'
D1S6             EQU  H'0006'
D1S7             EQU  H'0007'
LC4D1S0          EQU  H'0000'
LC4D1S1          EQU  H'0001'
LC4D1S2          EQU  H'0002'
LC4D1S3          EQU  H'0003'
LC4D1S4          EQU  H'0004'
LC4D1S5          EQU  H'0005'
LC4D1S6          EQU  H'0006'
LC4D1S7          EQU  H'0007'


;----- CLC4SEL1 Bits -----------------------------------------------------
D2S0             EQU  H'0000'
D2S1             EQU  H'0001'
D2S2             EQU  H'0002'
D2S3             EQU  H'0003'
D2S4             EQU  H'0004'
D2S5             EQU  H'0005'
D2S6             EQU  H'0006'
D2S7             EQU  H'0007'
LC4D2S0          EQU  H'0000'
LC4D2S1          EQU  H'0001'
LC4D2S2          EQU  H'0002'
LC4D2S3          EQU  H'0003'
LC4D2S4          EQU  H'0004'
LC4D2S5          EQU  H'0005'
LC4D2S6          EQU  H'0006'
LC4D2S7          EQU  H'0007'


;----- CLC4SEL2 Bits -----------------------------------------------------
D3S0             EQU  H'0000'
D3S1             EQU  H'0001'
D3S2             EQU  H'0002'
D3S3             EQU  H'0003'
D3S4             EQU  H'0004'
D3S5             EQU  H'0005'
D3S6             EQU  H'0006'
D3S7             EQU  H'0007'
LC4D3S0          EQU  H'0000'
LC4D3S1          EQU  H'0001'
LC4D3S2          EQU  H'0002'
LC4D3S3          EQU  H'0003'
LC4D3S4          EQU  H'0004'
LC4D3S5          EQU  H'0005'
LC4D3S6          EQU  H'0006'
LC4D3S7          EQU  H'0007'


;----- CLC4SEL3 Bits -----------------------------------------------------
D4S0             EQU  H'0000'
D4S1             EQU  H'0001'
D4S2             EQU  H'0002'
D4S3             EQU  H'0003'
D4S4             EQU  H'0004'
D4S5             EQU  H'0005'
D4S6             EQU  H'0006'
D4S7             EQU  H'0007'
LC4D4S0          EQU  H'0000'
LC4D4S1          EQU  H'0001'
LC4D4S2          EQU  H'0002'
LC4D4S3          EQU  H'0003'
LC4D4S4          EQU  H'0004'
LC4D4S5          EQU  H'0005'
LC4D4S6          EQU  H'0006'
LC4D4S7          EQU  H'0007'


;----- CLC4GLS0 Bits -----------------------------------------------------
G1D1N            EQU  H'0000'
G1D1T            EQU  H'0001'
G1D2N            EQU  H'0002'
G1D2T            EQU  H'0003'
G1D3N            EQU  H'0004'
G1D3T            EQU  H'0005'
G1D4N            EQU  H'0006'
G1D4T            EQU  H'0007'
LC4G1D1N         EQU  H'0000'
LC4G1D1T         EQU  H'0001'
LC4G1D2N         EQU  H'0002'
LC4G1D2T         EQU  H'0003'
LC4G1D3N         EQU  H'0004'
LC4G1D3T         EQU  H'0005'
LC4G1D4N         EQU  H'0006'
LC4G1D4T         EQU  H'0007'


;----- CLC4GLS1 Bits -----------------------------------------------------
G2D1N            EQU  H'0000'
G2D1T            EQU  H'0001'
G2D2N            EQU  H'0002'
G2D2T            EQU  H'0003'
G2D3N            EQU  H'0004'
G2D3T            EQU  H'0005'
G2D4N            EQU  H'0006'
G2D4T            EQU  H'0007'
LC4G2D1N         EQU  H'0000'
LC4G2D1T         EQU  H'0001'
LC4G2D2N         EQU  H'0002'
LC4G2D2T         EQU  H'0003'
LC4G2D3N         EQU  H'0004'
LC4G2D3T         EQU  H'0005'
LC4G2D4N         EQU  H'0006'
LC4G2D4T         EQU  H'0007'


;----- CLC4GLS2 Bits -----------------------------------------------------
G3D1N            EQU  H'0000'
G3D1T            EQU  H'0001'
G3D2N            EQU  H'0002'
G3D2T            EQU  H'0003'
G3D3N            EQU  H'0004'
G3D3T            EQU  H'0005'
G3D4N            EQU  H'0006'
G3D4T            EQU  H'0007'
LC4G3D1N         EQU  H'0000'
LC4G3D1T         EQU  H'0001'
LC4G3D2N         EQU  H'0002'
LC4G3D2T         EQU  H'0003'
LC4G3D3N         EQU  H'0004'
LC4G3D3T         EQU  H'0005'
LC4G3D4N         EQU  H'0006'
LC4G3D4T         EQU  H'0007'


;----- CLC4GLS3 Bits -----------------------------------------------------
G4D1N            EQU  H'0000'
G4D1T            EQU  H'0001'
G4D2N            EQU  H'0002'
G4D2T            EQU  H'0003'
G4D3N            EQU  H'0004'
G4D3T            EQU  H'0005'
G4D4N            EQU  H'0006'
G4D4T            EQU  H'0007'
LC4G4D1N         EQU  H'0000'
LC4G4D1T         EQU  H'0001'
LC4G4D2N         EQU  H'0002'
LC4G4D2T         EQU  H'0003'
LC4G4D3N         EQU  H'0004'
LC4G4D3T         EQU  H'0005'
LC4G4D4N         EQU  H'0006'
LC4G4D4T         EQU  H'0007'


;----- CLC5CON Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
INTN_CLC5CON     EQU  H'0003'
INTP_CLC5CON     EQU  H'0004'
OUT_CLC5CON      EQU  H'0005'
EN               EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
LC5MODE0         EQU  H'0000'
LC5MODE1         EQU  H'0001'
LC5MODE2         EQU  H'0002'
LC5INTN          EQU  H'0003'
LC5INTP          EQU  H'0004'
LC5OUT           EQU  H'0005'
LC5EN            EQU  H'0007'
LC5MODE0         EQU  H'0000'
LC5MODE1         EQU  H'0001'
LC5MODE2         EQU  H'0002'


;----- CLC5POL Bits -----------------------------------------------------
G1POL            EQU  H'0000'
G2POL            EQU  H'0001'
G3POL            EQU  H'0002'
G4POL            EQU  H'0003'
POL_CLC5POL      EQU  H'0007'
LC5G1POL         EQU  H'0000'
LC5G2POL         EQU  H'0001'
LC5G3POL         EQU  H'0002'
LC5G4POL         EQU  H'0003'
LC5POL           EQU  H'0007'


;----- CLC5SEL0 Bits -----------------------------------------------------
D1S0             EQU  H'0000'
D1S1             EQU  H'0001'
D1S2             EQU  H'0002'
D1S3             EQU  H'0003'
D1S4             EQU  H'0004'
D1S5             EQU  H'0005'
D1S6             EQU  H'0006'
D1S7             EQU  H'0007'
LC5D1S0          EQU  H'0000'
LC5D1S1          EQU  H'0001'
LC5D1S2          EQU  H'0002'
LC5D1S3          EQU  H'0003'
LC5D1S4          EQU  H'0004'
LC5D1S5          EQU  H'0005'
LC5D1S6          EQU  H'0006'
LC5D1S7          EQU  H'0007'


;----- CLC5SEL1 Bits -----------------------------------------------------
D2S0             EQU  H'0000'
D2S1             EQU  H'0001'
D2S2             EQU  H'0002'
D2S3             EQU  H'0003'
D2S4             EQU  H'0004'
D2S5             EQU  H'0005'
D2S6             EQU  H'0006'
D2S7             EQU  H'0007'
LC5D2S0          EQU  H'0000'
LC5D2S1          EQU  H'0001'
LC5D2S2          EQU  H'0002'
LC5D2S3          EQU  H'0003'
LC5D2S4          EQU  H'0004'
LC5D2S5          EQU  H'0005'
LC5D2S6          EQU  H'0006'
LC5D2S7          EQU  H'0007'


;----- CLC5SEL2 Bits -----------------------------------------------------
D3S0             EQU  H'0000'
D3S1             EQU  H'0001'
D3S2             EQU  H'0002'
D3S3             EQU  H'0003'
D3S4             EQU  H'0004'
D3S5             EQU  H'0005'
D3S6             EQU  H'0006'
D3S7             EQU  H'0007'
LC5D3S0          EQU  H'0000'
LC5D3S1          EQU  H'0001'
LC5D3S2          EQU  H'0002'
LC5D3S3          EQU  H'0003'
LC5D3S4          EQU  H'0004'
LC5D3S5          EQU  H'0005'
LC5D3S6          EQU  H'0006'
LC5D3S7          EQU  H'0007'


;----- CLC5SEL3 Bits -----------------------------------------------------
D4S0             EQU  H'0000'
D4S1             EQU  H'0001'
D4S2             EQU  H'0002'
D4S3             EQU  H'0003'
D4S4             EQU  H'0004'
D4S5             EQU  H'0005'
D4S6             EQU  H'0006'
D4S7             EQU  H'0007'
LC5D4S0          EQU  H'0000'
LC5D4S1          EQU  H'0001'
LC5D4S2          EQU  H'0002'
LC5D4S3          EQU  H'0003'
LC5D4S4          EQU  H'0004'
LC5D4S5          EQU  H'0005'
LC5D4S6          EQU  H'0006'
LC5D4S7          EQU  H'0007'


;----- CLC5GLS0 Bits -----------------------------------------------------
G1D1N            EQU  H'0000'
G1D1T            EQU  H'0001'
G1D2N            EQU  H'0002'
G1D2T            EQU  H'0003'
G1D3N            EQU  H'0004'
G1D3T            EQU  H'0005'
G1D4N            EQU  H'0006'
G1D4T            EQU  H'0007'
LC5G1D1N         EQU  H'0000'
LC5G1D1T         EQU  H'0001'
LC5G1D2N         EQU  H'0002'
LC5G1D2T         EQU  H'0003'
LC5G1D3N         EQU  H'0004'
LC5G1D3T         EQU  H'0005'
LC5G1D4N         EQU  H'0006'
LC5G1D4T         EQU  H'0007'


;----- CLC5GLS1 Bits -----------------------------------------------------
G2D1N            EQU  H'0000'
G2D1T            EQU  H'0001'
G2D2N            EQU  H'0002'
G2D2T            EQU  H'0003'
G2D3N            EQU  H'0004'
G2D3T            EQU  H'0005'
G2D4N            EQU  H'0006'
G2D4T            EQU  H'0007'
LC5G2D1N         EQU  H'0000'
LC5G2D1T         EQU  H'0001'
LC5G2D2N         EQU  H'0002'
LC5G2D2T         EQU  H'0003'
LC5G2D3N         EQU  H'0004'
LC5G2D3T         EQU  H'0005'
LC5G2D4N         EQU  H'0006'
LC5G2D4T         EQU  H'0007'


;----- CLC5GLS2 Bits -----------------------------------------------------
G3D1N            EQU  H'0000'
G3D1T            EQU  H'0001'
G3D2N            EQU  H'0002'
G3D2T            EQU  H'0003'
G3D3N            EQU  H'0004'
G3D3T            EQU  H'0005'
G3D4N            EQU  H'0006'
G3D4T            EQU  H'0007'
LC5G3D1N         EQU  H'0000'
LC5G3D1T         EQU  H'0001'
LC5G3D2N         EQU  H'0002'
LC5G3D2T         EQU  H'0003'
LC5G3D3N         EQU  H'0004'
LC5G3D3T         EQU  H'0005'
LC5G3D4N         EQU  H'0006'
LC5G3D4T         EQU  H'0007'


;----- CLC5GLS3 Bits -----------------------------------------------------
G4D1N            EQU  H'0000'
G4D1T            EQU  H'0001'
G4D2N            EQU  H'0002'
G4D2T            EQU  H'0003'
G4D3N            EQU  H'0004'
G4D3T            EQU  H'0005'
G4D4N            EQU  H'0006'
G4D4T            EQU  H'0007'
LC5G4D1N         EQU  H'0000'
LC5G4D1T         EQU  H'0001'
LC5G4D2N         EQU  H'0002'
LC5G4D2T         EQU  H'0003'
LC5G4D3N         EQU  H'0004'
LC5G4D3T         EQU  H'0005'
LC5G4D4N         EQU  H'0006'
LC5G4D4T         EQU  H'0007'


;----- CLC6CON Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
INTN_CLC6CON     EQU  H'0003'
INTP_CLC6CON     EQU  H'0004'
OUT_CLC6CON      EQU  H'0005'
EN               EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
LC6MODE0         EQU  H'0000'
LC6MODE1         EQU  H'0001'
LC6MODE2         EQU  H'0002'
LC6INTN          EQU  H'0003'
LC6INTP          EQU  H'0004'
LC6OUT           EQU  H'0005'
LC6EN            EQU  H'0007'
LC6MODE0         EQU  H'0000'
LC6MODE1         EQU  H'0001'
LC6MODE2         EQU  H'0002'


